cask_args appdir: '/Applications'

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "adoptopenjdk/openjdk"

brew "git"
brew "zsh"
brew "zsh-completions"
brew "docker"
brew "pyenv"
brew "rbenv"
brew "go"
brew "elixir"
brew "sbt"
brew "cocoapods"
brew "carthage"
brew "openssl"
brew "watchman"
brew "yarn"
brew 'mas'


# Utility
cask "1password"
cask "appcleaner"
cask "google-japanese-ime"
cask "karabiner-elements"
cask "slack"
cask 'spotify'

# Terminal
cask "iterm2"

# Editor / IDE
cask "android-stduio"
cask "visual-studio-code"
mas 'Xcode', id: 497799835

# Web Browser
cask "google-chrome"

# Development
cask "adoptopenjdk8"
cask "docker"
cask "postman"

# Design
cask "adobe-creative-cloud"
cask "figma"
cask "sketch"
cask 'th-makerx'
